{"class_name": "Sequential", "config": [{"class_name": "BatchNormalization", "config": {"beta_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.009999999776482582}, "name": "batchnormalization_1", "gamma_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.009999999776482582}, "mode": 0, "batch_input_shape": [null, 70, 320, 3], "epsilon": 0.001, "input_dtype": "float32", "momentum": 0.99, "trainable": true, "axis": 3}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "dim_ordering": "tf", "init": "he_normal", "nb_col": 5, "activity_regularizer": null, "bias": true, "W_regularizer": {"l2": 0.0012000000569969416, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "relu", "nb_filter": 25, "name": "convolution2d_1", "subsample": [2, 2], "b_regularizer": null, "nb_row": 5, "border_mode": "valid", "trainable": true, "W_constraint": null}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "dim_ordering": "tf", "init": "he_normal", "nb_col": 5, "activity_regularizer": null, "bias": true, "W_regularizer": {"l2": 0.0012000000569969416, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "relu", "nb_filter": 36, "name": "convolution2d_2", "subsample": [2, 2], "b_regularizer": null, "nb_row": 5, "border_mode": "valid", "trainable": true, "W_constraint": null}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "dim_ordering": "tf", "init": "he_normal", "nb_col": 5, "activity_regularizer": null, "bias": true, "W_regularizer": {"l2": 0.0012000000569969416, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "relu", "nb_filter": 48, "name": "convolution2d_3", "subsample": [2, 2], "b_regularizer": null, "nb_row": 5, "border_mode": "valid", "trainable": true, "W_constraint": null}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "dim_ordering": "tf", "init": "he_normal", "nb_col": 3, "activity_regularizer": null, "bias": true, "W_regularizer": {"l2": 0.0012000000569969416, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "relu", "nb_filter": 64, "name": "convolution2d_4", "subsample": [1, 1], "b_regularizer": null, "nb_row": 3, "border_mode": "valid", "trainable": true, "W_constraint": null}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "dim_ordering": "tf", "init": "he_normal", "nb_col": 3, "activity_regularizer": null, "bias": true, "W_regularizer": {"l2": 0.0012000000569969416, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "relu", "nb_filter": 64, "name": "convolution2d_5", "subsample": [1, 1], "b_regularizer": null, "nb_row": 3, "border_mode": "valid", "trainable": true, "W_constraint": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "activity_regularizer": null, "W_regularizer": {"l2": 0.0012000000569969416, "name": "L1L2Regularizer", "l1": 0.0}, "bias": true, "b_regularizer": null, "output_dim": 100, "name": "dense_1", "activation": "relu", "W_constraint": null, "init": "he_normal", "input_dim": 4224, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"b_constraint": null, "activity_regularizer": null, "W_regularizer": {"l2": 0.0012000000569969416, "name": "L1L2Regularizer", "l1": 0.0}, "bias": true, "b_regularizer": null, "output_dim": 50, "name": "dense_2", "activation": "relu", "W_constraint": null, "init": "he_normal", "input_dim": 100, "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "activity_regularizer": null, "W_regularizer": {"l2": 0.0012000000569969416, "name": "L1L2Regularizer", "l1": 0.0}, "bias": true, "b_regularizer": null, "output_dim": 10, "name": "dense_3", "activation": "relu", "W_constraint": null, "init": "he_normal", "input_dim": 50, "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "activity_regularizer": null, "W_regularizer": {"l2": 0.0012000000569969416, "name": "L1L2Regularizer", "l1": 0.0}, "bias": true, "b_regularizer": null, "output_dim": 1, "name": "dense_4", "activation": "linear", "W_constraint": null, "init": "he_normal", "input_dim": 10, "trainable": true}}], "keras_version": "1.2.0"}